app/app/controllers/boards_controller.rb

  def index
    @boards = Board.all
---
SELECT `boards`.* FROM `boards`

  def show
    @board= Board.find(params[:id])
---
SELECT  `boards`.* FROM `boards` WHERE `boards`.`id` = 1 LIMIT 1

  def create
    @board = Board.new(board_params)
    @board.user_id = current_user.id
    if @board.save
---
INSERT INTO `boards` (`title`, `image_id`, `reason`, `preparation`, `onepoint`, `created_at`, `updated_at`, `user_id`) VALUES ('雪から水を作る', '12c97c3800cfcf85ec2bd10c5ee4bb37ed8e6fff57d255e98d859a4ec04c', '遭難したように', '雪　500g', 'そのままだと食えないので注意', '2020-07-25 05:19:09', '2020-07-25 05:19:09', 5)