app/app/controllers/relationships_controller.rb

  def create
    @user = User.find params[:follow_id]
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 9 LIMIT 1

  def destroy
    @user = User.find params[:follow_id]
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 8 LIMIT 1