app/app/controllers/users_controller.rb

  def index
    @users = User.order(created_at: :desc).page(params[:page]).per(10)
---
SELECT  `users`.* FROM `users` ORDER BY `users`.`created_at` DESC LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM `users`

  def following
    @user = User.find(params[:id])
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 4 LIMIT 1

  def followers
    @user = User.find(params[:id])
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 9 LIMIT 1