app/app/views/relationships/_follow_button.html.erb

SELECT  `relationships`.* FROM `relationships` WHERE `relationships`.`user_id` = 4 AND `relationships`.`follow_id` = 9 LIMIT 1
---
  <% if current_user.following?(user) %>
    <%= form_for(current_user.relationships.find_by(follow_id: user.id), html: { method: :delete }) do |f| %>