app/app/models/user.rb

INSERT INTO `relationships` (`user_id`, `follow_id`, `created_at`, `updated_at`) VALUES (5, 14, '2020-07-23 16:53:53', '2020-07-23 16:53:53')
SELECT  `relationships`.* FROM `relationships` WHERE `relationships`.`user_id` = 4 AND `relationships`.`follow_id` = 9 LIMIT 1
---
    def follow(other_user)
      unless self == other_user
        self.relationships.find_or_create_by(follow_id: other_user.id)

SELECT  `relationships`.* FROM `relationships` WHERE `relationships`.`user_id` = 5 AND `relationships`.`follow_id` = 13 LIMIT 1
DELETE FROM `relationships` WHERE `relationships`.`id` = 33
---
    def unfollow(other_user)
      relationship = self.relationships.find_by(follow_id: other_user.id)
      relationship.destroy if relationship

SELECT  1 AS one FROM `users` INNER JOIN `relationships` ON `users`.`id` = `relationships`.`follow_id` WHERE `relationships`.`user_id` = 4 AND `users`.`id` = 14 LIMIT 1
---
    def following?(other_user)
      self.followings.include?(other_user)