app/app/views/boards/_form.html.erb

SELECT `tags`.* FROM `tags`
---
      <span>タグ</span>
      <%= f.collection_check_boxes(:tag_ids, Tag.all, :id, :name) do |tag| %>