app/app/views/boards/show.html.erb

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 5 LIMIT 1
---
        <h4 class="text-center board-title">新規投稿</h4>
        <% if @board.user.profile_image.present? %>

SELECT `tags`.* FROM `tags` INNER JOIN `board_tag_relations` ON `tags`.`id` = `board_tag_relations`.`tag_id` WHERE `board_tag_relations`.`board_id` = 8
---
        <%= @board.created_at.strftime("%Y年%m月%d日")%>に更新
        <% @board.tags.each do |tag|%>